var localhostUrl = 'http://192.168.66.20:8080/web_project/';
function getApp(){
  var configObj={
    url4:'http://192.168.5.139:8080/web_project/',//刚子
    url3:'http://192.168.5.107:8080/web_project/',//亚朋
    url2:'http://192.168.66.19:8080/web_project/',//阿想
    url1:'http://192.168.66.190:8082/web_project/',//测试
    url:'https://newweb.igongdi.cn/web_project/',//线上
    reg:/^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/,
    regCode:/^(([1][1-5])|([2][1-3])|([3][1-7])|([4][1-6])|([5][0-4])|([6][1-5])|([7][1])|([8][1-2]))\d{4}(([1][9]\d{2})|([2]\d{3}))(([0][1-9])|([1][0-2]))(([0][1-9])|([1-2][0-9])|([3][0-1]))\d{3}[0-9xX]$/,
    regUrl:/^(?=^.{3,255}$)(http(s)?:\/\/)?(www\.)?[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+(:\d+)*(\/\w+\.\w+)*([\?&]\w+=\w*)*$/,
    cerReg:/^[\u4e00-\u9fa5_a-zA-Z0-9]+$/,
    layer_success:'系统提示',
    layer_tip:'系统提示',
    layer_error:'系统提示',
    layer_confirm:'系统提示',
//  regUrl01:/^(?=^.{3,255}$)(http(s)?:\/\/)?[a-zA-Z0-9][-a-zA-Z0-9]{0-9}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0-9})+(:\d+)*(\/\w+\.\w+)*([\?&]\w+=\w*)*$/,
    function:{
    	100:"居住建筑",
    	200:"居住建筑配套工程",
    	300:"公共建筑",
    	301:"办公建筑",
    	302:"商业建筑",
    	303:"旅游建筑",
    	304:"科教文卫建筑",
    	305:"交通运输类",
    	306:"通信建筑",
    	307:"公共建筑配套工程",
    	400:"商住楼",
    	500:"农业建筑",
    	600:"农业建筑配套工程",
    	700:"工业建筑",
    	800:"工业建筑配套工程",
    	999:"其他",
    	10:"给水",
    	11:"排水"
    },
    proType:{
    	1:"房屋建筑工程",
    	2:"市政基础设施工程",
    	99:"其他"
    },
    memor : [{
      "uuid": "",
      "title": "欢迎加入智慧工地监管云平台",
      "content": "智慧工地监管云平台综合运用物联网、大数据、移动互联等跨界产业领域技术，成功打造出“智慧工地”系列产品。致力于建筑行业人工、材料、机械和现场环境的信息一体化建设，为建筑企业和政府监督管理部门提供一站式、全过程的云服务平台，以及智能安全监控终端装备，改变现有建筑施工行业传统的管理模式。",
      "imgSrc": ["welcome.jpg"],
      "days": "29",
      "years": "2018.06",
      "imgPath": "image/common/"
    }]

  }







  return configObj;
}
